posts/reading/akka-in-action/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Akka In Action | Warren Liu</title>
<link href="../../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../../rss.xml">
<link rel="canonical" href="https://example.com/posts/reading/akka-in-action/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Warren Liu">
<link rel="prev" href="../enterprise-integration-patterns/" title="Enterprise Integration Patterns" type="text/html">
<link rel="next" href="../../courses/deep-learning/" title="Deap Learning in Udacity" type="text/html">
<meta property="og:site_name" content="Warren Liu">
<meta property="og:title" content="Akka In Action">
<meta property="og:url" content="https://example.com/posts/reading/akka-in-action/">
<meta property="og:description" content="Table of Contents


Actors: a quick overview
The reactive Manifesto
Scaling with AKKA





Actors: a quick overview


Actors are a lot like message queues without the configuration and
message broker ">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2017-07-15T00:00:00+01:00">
<meta property="article:tag" content="akka">
<meta property="article:tag" content="scala">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Menubar -->

<nav class="navbar navbar-inverse navbar-static-top"><div class="container">
<!-- This keeps the margins nice -->
        <div class="navbar-header">
            <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#bs-navbar" aria-controls="bs-navbar" aria-expanded="false">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="https://example.com/">

                <span id="blog-title">Warren Liu</span>
            </a>
        </div>
<!-- /.navbar-header -->
        <div class="collapse navbar-collapse" id="bs-navbar" aria-expanded="false">
            <ul class="nav navbar-nav">
<li>
<a href="../../../archive.html">Archive</a>
                </li>
<li>
<a href="../../../categories/">Tags</a>
                </li>
<li>
<a href="../../../rss.xml">RSS feed</a>

                
            </li>
</ul>
<ul class="nav navbar-nav navbar-right">
<li>
    <a href="index.org" id="sourcelink">Source</a>
    </li>

                
            </ul>
</div>
<!-- /.navbar-collapse -->
    </div>
<!-- /.container -->
</nav><!-- End of Menubar --><div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        <div class="row">
            
            
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">Akka In Action</a></h1>

        <div class="metadata">
            <p class="byline author vcard"><span class="byline-name fn" itemprop="author">
                    Warren Liu
            </span></p>
            <p class="dateline"><a href="." rel="bookmark"><time class="published dt-published" datetime="2017-07-15T00:00:00+01:00" itemprop="datePublished" title="2017-07-15 00:00">2017-07-15 00:00</time></a></p>
            
        <p class="sourceline"><a href="index.org" class="sourcelink">Source</a></p>

        </div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Actors: a quick overview</a></li>
<li><a href="#sec-2">The reactive Manifesto</a></li>
<li><a href="#sec-3">Scaling with AKKA</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Actors: a quick overview</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Actors are a lot like message queues without the configuration and
message broker installation overhead.
</li>
<li>Actors don't "Do" anything unless they are sent a message.
</li>
<li>Messages are immutable.
</li>
<li>Actors receive messages one at a time and execute some behavior
whenever a message is received.
</li>
<li>Everything a actor does is executed asynchronously.
</li>
<li>Actors aren't like threads, but messages sent to them are pushed
through on a thread at some point in time.
</li>
<li>How actors are connected to threads is configurable.
</li>
<li>A message could be processed locally on some available thread, or
remotely on another server.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">The reactive Manifesto</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Blocking I/O limits opportunities for parallelism, so nonblocking
I/O is preferred.
</li>
<li>Synchronous interaction limits opportunities for parallelism, so
asynchornous interaction is preferred.
</li>
<li>Polling reduce opportunity to use fewer resources, so an
event-driven style is preferred.
</li>
<li>If one node can bring down all other nodes, that's a waste of
resources. So you need isolation of errors (resilience) to avoid
losing all your work.
</li>
<li>System need to be elastic: if there are less demand, you want to use
fewer resources. If there is more demand, use more resources, but
never more than required.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Scaling with AKKA</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>The current state of the Converstaion can be rebuilt by <b>replaying</b>
the events that occurred to the im-momory Conversation, so it can
continue where it left off.
</li>
<li>This type of database is often called a <b>journal</b>, and the technique
is known as <b>event sourcing</b>.
</li>
<li>The journal become a uniform service. All it needs to do is store
all events in sequence, and make it possible to retrieve the events
in the same sequence as they were written to the journal.
</li>
<li>It is hard to imagine how we could keep the conversations consistent
across many servers. and what would happen if there were too many
conversations to fit in one server?
<ul class="org-ul">
<li>divide the conversations over the servers in a predictable way, or
keep track of where every conversation lives.
</li>
<li>This is called <b>sharding</b>, or <b>partitioning</b>.
</li>
<li>We can keep using the simple in-memory model of Conversations if
we have a generic event-sourced journal and a way to indicate how
Conversations should be partitioned.
</li>
</ul>
</li>
<li>
</li>
</ul>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><ul itemprop="keywords" class="tags">
<li><a class="tag p-category" href="../../../categories/akka/" rel="tag">akka</a></li>
            <li><a class="tag p-category" href="../../../categories/scala/" rel="tag">scala</a></li>
        </ul>
<ul class="pager hidden-print">
<li class="previous">
                <a href="../enterprise-integration-patterns/" rel="prev" title="Enterprise Integration Patterns">Previous post</a>
            </li>
            <li class="next">
                <a href="../../courses/deep-learning/" rel="next" title="Deap Learning in Udacity">Next post</a>
            </li>
        </ul></nav></aside></article>
</div>
        <!--End of body content-->

        <footer id="footer">
            Contents © 2017         <a href="mailto:n.tesla@example.com">Warren Liu</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
            
        </footer>
</div>
</div>


            <script src="../../../assets/js/all-nocdn.js"></script><script>$('a.image-reference:not(.islink) img:not(.islink)').parent().colorbox({rel:"gal",maxWidth:"100%",maxHeight:"100%",scalePhotos:true});</script><!-- fancy dates --><script>
    moment.locale("en");
    fancydates(0, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates -->
</body>
</html>
